<?php
require 'Labyrinth.php';

$array = array(
    0 => array(
        0 => 1,
        1 => 1,
        2 => 0,
        3 => 0,
        4 => 1,
        5 => 1,
        6 => 0,
        7 => 1,
        8 => 0,
        9 => 1
    ),
    1 => array(
        0 => 1,
        1 => 0,
        2 => 0,
        3 => 0,
        4 => 0,
        5 => 0,
        6 => 1,
        7 => 0,
        8 => 0,
        9 => 0
    ),
    2 => array(
        0 => 0,
        1 => 0,
        2 => 1,
        3 => 0,
        4 => 0,
        5 => 0,
        6 => 1,
        7 => 1,
        8 => 0,
        9 => 0
    ),
    3 => array(
        0 => 1,
        1 => 1,
        2 => 0,
        3 => 1,
        4 => 0,
        5 => 0,
        6 => 0,
        7 => 0,
        8 => 0,
        9 => 1
    ),
    4 => array(
        0 => 1,
        1 => 0,
        2 => 0,
        3 => 0,
        4 => 0,
        5 => 1,
        6 => 1,
        7 => 1,
        8 => 0,
        9 => 0
    ),
    5 => array(
        0 => 1,
        1 => 0,
        2 => 0,
        3 => 1,
        4 => 0,
        5 => 0,
        6 => 1,
        7 => 1,
        8 => 0,
        9 => 0
    ),
    6 => array(
        0 => 0,
        1 => 0,
        2 => 0,
        3 => 0,
        4 => 0,
        5 => 0,
        6 => 0,
        7 => 1,
        8 => 0,
        9 => 1
    ),
    7 => array(
        0 => 0,
        1 => 1,
        2 => 0,
        3 => 0,
        4 => 0,
        5 => 0,
        6 => 0,
        7 => 1,
        8 => 1,
        9 => 1
    ),
    8 => array(
        0 => 0,
        1 => 0,
        2 => 0,
        3 => 0,
        4 => 1,
        5 => 1,
        6 => 0,
        7 => 0,
        8 => 0,
        9 => 0
    ),
    9 => array(
        0 => 1,
        1 => 0,
        2 => 0,
        3 => 0,
        4 => 0,
        5 => 0,
        6 => 0,
        7 => 1,
        8 => 1,
        9 => 0
    )
);
// создаем класс лабиринт
$labyrinth = new Labyrinth($array);
// задаем точку старта
$labyrinth->setStartPoint(0, 3);
// задаем точку финиша
$labyrinth->setFinishPoint(8, 9);
// выводим лабиринт без пути
echo $labyrinth->display();
// рассчитываем путь
$labyrinth->calculatePath();
// выводим лабиринт и путь прохода
echo $labyrinth->display();
